ZXDaniel1982/CLearning/STM32/register/stm32app/Core/Src/sdio.c
    if (errorstatus != SD_OK) {
        /*!< CMD Response TimeOut (wait for CMDSENT flag) */
        tftprintf("%s:%d", __func__, __LINE__);
        return;
    }

    errorstatus = SD_InitializeCards();

    if (errorstatus != SD_OK) {
        /*!< CMD Response TimeOut (wait for CMDSENT flag) */
        tftprintf("%s:%d", __func__, __LINE__);
        return;
    }

    /*!< Configure the SDIO peripheral */
    /*!< SDIOCLK = HCLK, SDIO_CK = HCLK/(2 + SDIO_TRANSFER_CLK_DIV) */
    SDIO_InitStructure.SDIO_ClockDiv = SDIO_TRANSFER_CLK_DIV; 
    SDIO_InitStructure.SDIO_ClockEdge = SDIO_ClockEdge_Rising;
    SDIO_InitStructure.SDIO_ClockBypass = SDIO_ClockBypass_Disable;
    SDIO_InitStructure.SDIO_ClockPowerSave = SDIO_ClockPowerSave_Disable;
    SDIO_InitStructure.SDIO_BusWide = SDIO_BusWide_1b;
    SDIO_InitStructure.SDIO_HardwareFlowControl = SDIO_HardwareFlowControl_Disable;
    SDIO_Init(&SDIO_InitStructure);
  
    if (errorstatus == SD_OK) {
        /*----------------- Read CSD/CID MSD registers ------------------*/
        errorstatus = SD_GetCardInfo(&SDCardInfo);
    }

    if (errorstatus == SD_OK) {
        /*----------------- Select Card --------------------------------*/
        errorstatus = SD_SelectDeselect((uint32_t) (SDCardInfo.RCA << 16));
    }

    if (errorstatus == SD_OK) {
        errorstatus = SD_EnableWideBusOperation(SDIO_BusWide_4b);
    }  

    /* Set Device Transfer Mode to DMA */
    if (errorstatus == SD_OK) {  
        errorstatus = SD_SetDeviceMode(SD_POLLING_MODE);
    }
  
    tftprintf("%s:%d", __func__, __LINE__);
    return;
}

#if 0
uint32_t SD_ReadBlock(uint8_t *pData, uint32_t BlockAdd, uint32_t NumberOfBlocks, uint32_t Timeout)
{
    SDIO_DataInitTypeDef config;
    uint32_t errorstate = SDMMC_ERROR_NONE;
    uint32_t tickstart = HAL_GetTick();
    uint32_t count = 0U, *tempbuff = (uint32_t *)pData;
  
    if(NULL == pData) {
        return;
    }
 
    if(hsd->State == HAL_SD_STATE_READY) {
        if((BlockAdd + NumberOfBlocks) > LogBlockNbr) {
            return SDMMC_ERROR_ADDR_OUT_OF_RANGE;
        }
    
        /* Initialize data control register */
        SDIO->DCTRL = 0U;
        
        if(CardType != CARD_SDHC_SDXC) {
            BlockAdd *= 512U;
        }
          
        /* Set Block Size for Card */
        errorstate = SDMMC_CmdBlockLength(512U);
        if(errorstate != SDMMC_ERROR_NONE) {
            /* Clear all the static flags */
            __SDIO_CLEAR_FLAG(SDIO, SDIO_STATIC_FLAGS);      
            return errorstate;
        }
    
        /* Configure the SD DPSM (Data Path State Machine) */
        SDIO_ConfigData(SDMMC_DATATIMEOUT, NumberOfBlocks * 512U, SDIO_DATABLOCK_SIZE_512B,
                        SDIO_TRANSFER_DIR_TO_SDIO, SDIO_TRANSFER_MODE_BLOCK, SDIO_DPSM_ENABLE);
        
        /* Read block(s) in polling mode */
        if(NumberOfBlocks > 1U) {
            hsd->Context = SD_CONTEXT_READ_MULTIPLE_BLOCK;
            /* Read Multi Block command */ 
            errorstate = SDMMC_CmdReadMultiBlock(hsd->Instance, BlockAdd);
        } else {
            hsd->Context = SD_CONTEXT_READ_SINGLE_BLOCK;
            /* Read Single Block command */
            errorstate = SDMMC_CmdReadSingleBlock(hsd->Instance, BlockAdd);
        }

        if(errorstate != SDMMC_ERROR_NONE) {
            /* Clear all the static flags */
            __HAL_SD_CLEAR_FLAG(hsd, SDIO_STATIC_FLAGS);
            return errorstate;
        }
          
        /* Poll on SDIO flags */
        while(!__HAL_SD_GET_FLAG(hsd, SDIO_FLAG_RXOVERR | SDIO_FLAG_DCRCFAIL | SDIO_FLAG_DTIMEOUT | SDIO_FLAG_DATAEND | SDIO_STA_STBITERR))
        {
          if(__HAL_SD_GET_FLAG(hsd, SDIO_FLAG_RXFIFOHF))
          {
            /* Read data from SDIO Rx FIFO */
            for(count = 0U; count < 8U; count++)
            {
              *(tempbuff + count) = SDIO_ReadFIFO(hsd->Instance);
            }
            tempbuff += 8U;
          }
          
          if((Timeout == 0U)||((HAL_GetTick()-tickstart) >=  Timeout))
          {
            /* Clear all the static flags */
            __HAL_SD_CLEAR_FLAG(hsd, SDIO_STATIC_FLAGS);
            hsd->ErrorCode |= HAL_SD_ERROR_TIMEOUT;
            hsd->State= HAL_SD_STATE_READY;
            return HAL_TIMEOUT;
          }
        }
    
        /* Send stop transmission command in case of multiblock read */
        if(__HAL_SD_GET_FLAG(hsd, SDIO_FLAG_DATAEND) && (NumberOfBlocks > 1U))
        {    
          if(hsd->SdCard.CardType != CARD_SECURED)
          {
            /* Send stop transmission command */
            errorstate = SDMMC_CmdStopTransfer(hsd->Instance);
            if(errorstate != HAL_SD_ERROR_NONE)
            {
              /* Clear all the static flags */
              __HAL_SD_CLEAR_FLAG(hsd, SDIO_STATIC_FLAGS);
              hsd->ErrorCode |= errorstate;
              hsd->State = HAL_SD_STATE_READY;
              return HAL_ERROR;
            }
          }
        }
    
        /* Get error state */
        if(__HAL_SD_GET_FLAG(hsd, SDIO_FLAG_DTIMEOUT))
        {
          /* Clear all the static flags */
          __HAL_SD_CLEAR_FLAG(hsd, SDIO_STATIC_FLAGS);
          hsd->ErrorCode |= HAL_SD_ERROR_DATA_TIMEOUT;
          hsd->State = HAL_SD_STATE_READY;
          return HAL_ERROR;
        }
        else if(__HAL_SD_GET_FLAG(hsd, SDIO_FLAG_DCRCFAIL))
        {
          /* Clear all the static flags */
          __HAL_SD_CLEAR_FLAG(hsd, SDIO_STATIC_FLAGS);
          hsd->ErrorCode |= HAL_SD_ERROR_DATA_CRC_FAIL;
          hsd->State = HAL_SD_STATE_READY;
          return HAL_ERROR;
        }
        else if(__HAL_SD_GET_FLAG(hsd, SDIO_FLAG_RXOVERR))
        {
          /* Clear all the static flags */
          __HAL_SD_CLEAR_FLAG(hsd, SDIO_STATIC_FLAGS);
          hsd->ErrorCode |= HAL_SD_ERROR_RX_OVERRUN;
          hsd->State = HAL_SD_STATE_READY;
          return HAL_ERROR;
        }
        
        /* Empty FIFO if there is still any data */
        while ((__HAL_SD_GET_FLAG(hsd, SDIO_FLAG_RXDAVL)))
        {
          *tempbuff = SDIO_ReadFIFO(hsd->Instance);
          tempbuff++;
          
          if((Timeout == 0U)||((HAL_GetTick()-tickstart) >=  Timeout))
          {
            /* Clear all the static flags */
            __HAL_SD_CLEAR_FLAG(hsd, SDIO_STATIC_FLAGS);        
            hsd->ErrorCode |= HAL_SD_ERROR_TIMEOUT;
            hsd->State= HAL_SD_STATE_READY;
            return HAL_ERROR;
          }
        }
        
        /* Clear all the static flags */
        __HAL_SD_CLEAR_FLAG(hsd, SDIO_STATIC_FLAGS);
        
        hsd->State = HAL_SD_STATE_READY;
        
        return HAL_OK;
  }
  else
  {
    hsd->ErrorCode |= HAL_SD_ERROR_BUSY;
    return HAL_ERROR;
  }
}

void SD_WriteBlock(uint32_t *writebuff, uint32_t WriteAddr, uint16_t BlockSize)
{

}
#endif
